# DS2002 Midterm Project - Britney Hoang


####  For my project, I used the Sakila database from MySQL which looks at DVD rental transactions, film information, actors, and more. The simple buisness procedure that I choose to look at is rental sales at the store. I decided to inquire about the rental sales of each genre at the DVD rental place in order to be able to analyze which genre(s) are most popular and do the best among customers. This information would be useful for buisness owners to see which kinds of movies tend to make the most profit and so they could get more of that specific genre. 


### Import the Necessary Libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases

In [2]:
mysql_uid = "jtupitza"
mysql_pwd = "Passw0rd123"
port = "3306"
user_id = "root"

atlas_cluster_name = "period.vb5iusq"
atlas_user_name = "britneyhoang0"
atlas_password = "Shawnmendes1"

host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://britneyhoang0:Shawnmendes1@period.vb5iusq.mongodb.net

### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    
    return dframe

def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

### Populate MongoDB with Source Data

#### I uploaded a JSON file to MongoDB

In [4]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'Data')

json_files = {'film' : 'film_table.json'}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")

        
client.close()

Collection(Database(MongoClient(host=['ac-krajkxs-shard-00-01.vb5iusq.mongodb.net:27017', 'ac-krajkxs-shard-00-02.vb5iusq.mongodb.net:27017', 'ac-krajkxs-shard-00-00.vb5iusq.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-100mcj-shard-0', tls=True), 'sakila'), 'film') was successfully loaded.

### Create and Populate the New Dimension Tables
#### Extract Data from the Source MongoDB Collection, CSV, and SQL Into DataFrames

In [5]:
query = {}
collection = "film"

df_film = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,0,6,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,0,3,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [6]:
data_dir = os.path.join(os.getcwd(), 'Data')
csv_file = os.path.join(data_dir, 'rental_table.csv')

df_rental =pd.read_csv(csv_file)
df_rental.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [7]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_sql_dataframe(user_id, pwd, src_dbname, sql_inventory)
df_inventory.head(2)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17

In [8]:
sql_film_category = "SELECT * FROM sakila.film_category;"
df_film_category = get_sql_dataframe(user_id, pwd, src_dbname, sql_film_category)
df_film_category.head(2)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09

In [9]:
sql_category = "SELECT * FROM sakila.category;"
df_category = get_sql_dataframe(user_id, pwd, src_dbname, sql_category)
df_category.head(2)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27

### Date Dimenstion Requirement
#### I got the date dimension from LAB2c

In [10]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_date = get_sql_dataframe(mysql_uid,mysql_pwd, dst_dbname, sql_dim_date)
df_date.full_date = df_date.full_date.astype('datetime64')
df_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [14]:
#df rental has 1000 rows
print(df_rental.shape)

(1000, 7)

In [15]:
#df dim return date has more than 1000 rows, I need to size it down to combine
#take the last 1000 rows from the date df. this is because the last 1000 are later dates than the first 1000
df_return_date = df_date.rename(columns={"full_date" : "return_date"})
df_return_date = df_return_date.head(1000)
df_return_date.head(2)

   date_key return_date
0  20000101  2000-01-01
1  20000102  2000-01-02

In [16]:
#concatenate the single column of df_dim_rent
df_rental.drop(['return_date'], axis=1, inplace=True)
df_rental = pd.concat([df_rental, df_return_date['return_date']], axis=1)
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,staff_id,last_update,return_date
0,1,2005-05-24 22:53:30,367,130,1,2006-02-15 21:30:53,2000-01-01
1,2,2005-05-24 22:54:33,1525,459,1,2006-02-15 21:30:53,2000-01-02
2,3,2005-05-24 23:03:39,1711,408,1,2006-02-15 21:30:53,2000-01-03
3,4,2005-05-24 23:04:41,2452,333,2,2006-02-15 21:30:53,2000-01-04
4,5,2005-05-24 23:05:21,2079,222,1,2006-02-15 21:30:53,2000-01-05

### Perform Any Necessary Transformations to the DataFrames
#### Here is where I renamed and dropped columns

In [17]:
drop_cols = ['language_id','original_language_id','special_features','replacement_cost',"length"]
df_film.drop(drop_cols, axis=1, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True)

df_film.head(2)

,film_key,title,description,release_year,rental_duration,rating,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,PG,2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,G,2006-02-15 05:03:42

In [18]:
drop_cols = ['staff_id','return_date','last_update']
df_rental.rename(columns={"rental_id":"rental_key","inventory_id":"inventory_key","customer_id":"customer_key"}, inplace=True)
df_rental.drop(drop_cols, axis=1, inplace=True)
df_rental.head(2)

   rental_key          rental_date  inventory_key  customer_key
0           1  2005-05-24 22:53:30            367           130
1           2  2005-05-24 22:54:33           1525           459

In [19]:
drop_cols = ['store_id','last_update']
df_inventory.drop(drop_cols, axis=1, inplace=True)
df_inventory.rename(columns={"inventory_id":"inventory_key","film_id":"film_key"}, inplace=True)
df_inventory.head(2)

   inventory_key  film_key
0              1         1
1              2         1

In [20]:
df_film_category.rename(columns={"film_id":"film_key","category_id":"category_key"}, inplace=True)
df_film_category.insert(0, 'film_category_key', range(1, df_film_category.shape[0]+1))
df_film_category.head(2)

   film_category_key  film_key  category_key         last_update
0                  1         1             6 2006-02-15 05:07:09
1                  2         2            11 2006-02-15 05:07:09

In [21]:
df_category.rename(columns={"category_id":"category_key"}, inplace=True)
df_category.head(2)

   category_key       name         last_update
0             1     Action 2006-02-15 04:46:27
1             2  Animation 2006-02-15 04:46:27

In [22]:
df_return_date.head(2)

   date_key return_date
0  20000101  2000-01-01
1  20000102  2000-01-02

###  Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

In [23]:
db_operation = "insert"

tables = [('dim_films', df_film, 'film_key'),
          ('dim_return_date', df_return_date, 'date_key'),
          ('dim_rentals', df_rental, 'rental_key'),
          ('dim_inventory', df_inventory, 'inventory_key'),
          ('dim_film_category', df_film_category,'film_category_key'),
          ('dim_category', df_category, 'category_key')]

In [24]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Validate New Dimension Tables created

In [25]:
sql_inventory = "SELECT * FROM sakila_dw.dim_inventory;"
dim_inventory = get_sql_dataframe(user_id, pwd, src_dbname, sql_inventory)
dim_inventory.head(2)

   inventory_key  film_key
0              1         1
1              2         1

In [26]:
sql_film = "SELECT * FROM sakila_dw.dim_films;"
dim_film = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_film)
dim_film.head(2)

,film_key,title,description,release_year,rental_duration,rating,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,PG,2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,G,2006-02-15 05:03:42

In [27]:

sql_rental = "SELECT * FROM sakila_dw.dim_rentals;"
dim_rental = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_rental)
dim_rental.head(2)

   rental_key          rental_date  inventory_key  customer_key
0           1  2005-05-24 22:53:30            367           130
1           2  2005-05-24 22:54:33           1525           459

In [28]:
sql_film_category = "SELECT * FROM sakila_dw.dim_film_category;"
dim_film_category = get_sql_dataframe(user_id, pwd, src_dbname, sql_film_category)
dim_film_category.head(2)

   film_category_key  film_key  category_key         last_update
0                  1         1             6 2006-02-15 05:07:09
1                  2         2            11 2006-02-15 05:07:09

In [29]:
sql_category = "SELECT * FROM sakila_dw.dim_category;"
dim_category = get_sql_dataframe(user_id, pwd, src_dbname, sql_category)
dim_category.head(2)

   category_key       name         last_update
0             1     Action 2006-02-15 04:46:27
1             2  Animation 2006-02-15 04:46:27

In [30]:
sql_return_date = "SELECT * FROM sakila_dw.dim_return_date;"
dim_return_date = get_sql_dataframe(user_id, pwd, src_dbname, sql_return_date)
dim_return_date.head(2)

   date_key return_date
0  20000101  2000-01-01
1  20000102  2000-01-02


### Create & Populate the Fact Table that models Buisness Process
#### I selected necessary keys and joined the tables together

In [31]:
sql_fact_genres ="""
SELECT r.rental_key, 
r.rental_date,
i.inventory_key, 
f.film_key,
f.title,
f.rating,
f.release_year, 
fc.film_category_key,
c.category_key,
c.name
FROM sakila_dw.dim_rentals as r
INNER JOIN sakila_dw.dim_inventory as i
ON r.inventory_key = i.inventory_key
INNER JOIN sakila_dw.dim_films as f
ON i.film_key = f.film_key
INNER JOIN sakila_dw.dim_film_category as fc
ON f.film_key = fc.film_key
INNER JOIN sakila_dw.dim_category as c
ON fc.category_key = c.category_key;

"""

df_fact_genres = get_dataframe(user_id, pwd, host_name, src_dbname, sql_fact_genres)
df_fact_genres.head(5)

,rental_key,rental_date,inventory_key,film_key,title,rating,release_year,film_category_key,category_key,name
0,972,2005-05-30 20:21:07,2,1,ACADEMY DINOSAUR,PG,2006,1,6,Documentary
1,361,2005-05-27 07:03:28,6,1,ACADEMY DINOSAUR,PG,2006,1,6,Documentary
2,995,2005-05-31 00:06:02,17,4,AFFAIR PREJUDICE,G,2006,4,11,Horror
3,465,2005-05-27 20:44:36,20,4,AFFAIR PREJUDICE,G,2006,4,11,Horror
4,552,2005-05-28 07:53:38,23,5,AFRICAN EGG,G,2006,5,8,Family

In [32]:
column_name_map = {"name":"genre"}

df_fact_genres.rename(columns=column_name_map, inplace=True)

# Reorder the Columns
reordered_columns = ['genre','title','rental_date'
                     ,'rating','release_year','category_key','rental_key','film_category_key'
                     ,'film_key','inventory_key']

df_fact_genres = df_fact_genres[reordered_columns]

# Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df_fact_genres.insert(0, "fact_genre_key", range(1, df_fact_genres.shape[0]+1))
df_fact_genres.head()

,fact_genre_key,genre,title,rental_date,rating,release_year,category_key,rental_key,film_category_key,film_key,inventory_key
0,1,Documentary,ACADEMY DINOSAUR,2005-05-30 20:21:07,PG,2006,6,972,1,1,2
1,2,Documentary,ACADEMY DINOSAUR,2005-05-27 07:03:28,PG,2006,6,361,1,1,6
2,3,Horror,AFFAIR PREJUDICE,2005-05-31 00:06:02,G,2006,11,995,4,4,17
3,4,Horror,AFFAIR PREJUDICE,2005-05-27 20:44:36,G,2006,11,465,4,4,20
4,5,Family,AFRICAN EGG,2005-05-28 07:53:38,G,2006,8,552,5,5,23

In [33]:
db_operation = "insert"
tables = [('fact_genres', df_fact_genres, 'fact_genre_key')]

In [34]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Validate Fact Table Created

In [38]:
sql_fact_genres = "SELECT * FROM sakila_dw.fact_genres;"
df_fact_genres = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_fact_genres)
df_fact_genres.head(5)

,fact_genre_key,genre,title,rental_date,rating,release_year,category_key,rental_key,film_category_key,film_key,inventory_key
0,1,Documentary,ACADEMY DINOSAUR,2005-05-30 20:21:07,PG,2006,6,972,1,1,2
1,2,Documentary,ACADEMY DINOSAUR,2005-05-27 07:03:28,PG,2006,6,361,1,1,6
2,3,Horror,AFFAIR PREJUDICE,2005-05-31 00:06:02,G,2006,11,995,4,4,17
3,4,Horror,AFFAIR PREJUDICE,2005-05-27 20:44:36,G,2006,11,465,4,4,20
4,5,Family,AFRICAN EGG,2005-05-28 07:53:38,G,2006,8,552,5,5,23

### SQL Query Statement

#### This solution reflects the amount of times each genre was rented out through the year. As you can see, the most popular genres ended up being Family and Drama.

In [39]:
sql_test= """
SELECT fact_genres.genre,
COUNT('rental_date') as Rental_Count
FROM sakila_dw.fact_genres
GROUP BY fact_genres.genre
ORDER BY Rental_Count DESC;
""".format(dst_dbname)

df_test = get_dataframe(user_id,pwd,host_name,src_dbname,sql_test)
df_test.head(16)

          genre  Rental_Count
0        Family            76
1         Drama            76
2   Documentary            74
3        Action            74
4        Sci-Fi            74
5        Comedy            65
6        Sports            65
7      Children            63
8       Foreign            62
9     Animation            61
10        Games            60
11        Music            56
12     Classics            52
13          New            49
14       Travel            49
15       Horror            44